package com.example.routeoptimizationdemo.mock

import com.example.routeoptimizationdemo.data.Location

object RouteMock {
    // 10건
    val D102 = listOf(
        Location("233. 족발야시장 내포신도시점(신)", 126.6809249, 36.6604427),
        Location("고래감자탕 홍성터미널점", 126.6763165, 36.6010318),
        Location("노랑통닭 예산점", 126.8303919, 36.6928317),
        Location("달떡볶이 예산점", 126.8325942, 36.6850683),
        Location("마포갈매기 충남홍성점", 126.6631603, 36.6025102),
        Location("샌두_내포점(22)", 126.6802232, 36.6616210),
        Location("할맥 충남예산점", 126.8332478, 36.6927284),
        Location("할맥 충남청양점(소)", 126.8008967, 36.4477454),
        Location("할맥 홍성법원점(소)", 126.6490952, 36.5993843),
        Location("화락 예산목리점", 126.6756390, 36.6636388),
    )

    // 24건
    val D110 = listOf(
        Location("(RS)_벤탄빌라 안양점 안양시 만안구(직배)(24)", 126.9307467, 37.3963333),
        Location("(RS)_서가앤쿡 군포산본점(직배)(23)", 126.9304011, 37.3592550),
        Location("(RS)_파스타어때 안양시 만안구(직배)(24)", 126.9217127, 37.3998743),
        Location("(RS)_피크닉테이블 안양시 만안구(직배)(24)", 126.9303015, 37.3965285),
        Location("067. 족발야시장 금정역점", 126.9426534, 37.3716381),
        Location("S-준코2 안양지하홀릭점", 126.9229625, 37.3993285),
        Location("S-쥬씨 산본점(양수)", 126.9323659, 37.3598927),
        Location("노랑통닭 안양명학역점", 126.9338087, 37.3847878),
        Location("노랑통닭 안양박달점", 126.9098032, 37.4033632),
        Location("불불이족발 안양일번가점", 126.9216625, 37.4002645),
        Location("쇼부라멘 군포부곡점", 126.9410393, 37.3268274),
        Location("오르토그릴_군포", 126.9410393, 37.3268274),
        Location("쥬씨차얌 성결대점", 126.9306400, 37.3825346),
        Location("쥬씨차얌 연성대점(신2)", 126.9124012, 37.3965321),
        Location("치킨플러스 군포금정점", 126.9437512, 37.3693309),
        Location("푸줏간 군포점", 126.9327112, 37.3598778),
        Location("할맥 군포금정점", 126.9426282, 37.3712330),
        Location("할맥 군포산본점", 126.9314919, 37.3589429),
        Location("할맥 군포삼성마을점", 126.9349940, 37.3370020),
        Location("할맥 안양박달점", 126.9085062, 37.4054094),
        Location("할맥 안양일번가점", 126.9225166, 37.3991486),
        Location("할맥 의왕역점", 126.9516449, 37.3208243),
        Location("화락 군포산본점", 126.9313093, 37.3591446),
        Location("화락 의왕역점", 126.9553578, 37.3211322),
    )
}
